app/views/courses/show.html.erb

  <div>
    <%= link_to(enrollment.student.first_name, edit_student_path(enrollment.student.id)) %>
---
SELECT "students".* FROM "students" INNER JOIN "enrollments" ON "students"."id" = "enrollments"."student_id" WHERE "enrollments"."course_id" = $1  [["course_id", 1]]