app/controllers/courses_controller.rb

  def create
    # Course.create(name: "Math")
    @course = Course.create(course_params)
---
INSERT INTO "courses" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test course"], ["created_at", "2015-02-26 21:40:14.855091"], ["updated_at", "2015-02-26 21:40:14.855091"]]

  def update
    find_course
    @course.update_attributes(course_params)
---
UPDATE "courses" SET "name" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["name", "MATH"], ["updated_at", "2015-02-26 22:06:30.102303"], ["id", 1]]

  def destroy
    find_course
    @course.destroy
---
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 5]]

        def find_course
          @course = Course.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 5]]