app/controllers/enrollments_controller.rb

  def new
    @enrollment = Enrollment.new
    @student_options = Student.all.map{|u| [ u.first_name, u.id ] }
    @teacher_options = Teacher.all.map{|u| [ u.first_name, u.id ] }
    @course_options = Course.all.map{|u| [ u.name, u.id ] }
---
SELECT "students".* FROM "students"
SELECT "teachers".* FROM "teachers"
SELECT "courses".* FROM "courses"

  def create
    @enrollment = Enrollment.create(enrollment_params)
---
INSERT INTO "enrollments" ("teacher_id", "student_id", "course_id", "points", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["teacher_id", 1], ["student_id", 1], ["course_id", 1], ["points", 111], ["created_at", "2015-02-26 23:20:35.692224"], ["updated_at", "2015-02-26 23:20:35.692224"]]

  def update
    find_enrollment
    @enrollment.update_attributes(enrollment_params)
---
UPDATE "enrollments" SET "points" = $1, "updated_at" = $2 WHERE "enrollments"."id" = $3  [["points", 5], ["updated_at", "2015-03-02 02:32:39.090681"], ["id", 1]]

  def find_course
   @course = Course.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 7]]

          def find_enrollment
            @enrollment = Enrollment.find(params[:id])
---
SELECT  "enrollments".* FROM "enrollments" WHERE "enrollments"."id" = $1 LIMIT 1  [["id", 8]]