app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "a student"], ["last_name", "is here"], ["created_at", "2015-02-26 21:48:23.529811"], ["updated_at", "2015-02-26 21:48:23.529811"]]
---
  def create
      # Teacher.create(first_name: "Angelo", last_name: "Cisneros")
      @student = Student.create(student_params)