app/controllers/teachers_controller.rb

  def create
     @teacher = Teacher.create(teacher_params)
---
INSERT INTO "teachers" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "a"], ["last_name", "b"], ["email", "a@b.com"], ["created_at", "2015-02-26 21:45:24.803974"], ["updated_at", "2015-02-26 21:45:24.803974"]]

   def find_teacher
    @teacher = Teacher.find(params[:id])
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT 1  [["id", 2]]